// 1-----------------------------------------
  // for( let i=20; i <= 30; i=i+0.5){
    
  //   console.log(i)
  // }

// 2 -----------------------------------------

// let doll=27

// for( let i=0; i<=100; i=i+10){
//   console.log(i * doll)
// }

// 3------------------------------------------

// let x = Number(prompt("Будь ласка укажить число "));
// 
// for (let i= 1; i<=100; i++){
//    if (i**2 <=x){
//     console.log(i)
//    }
// }



// 4------------------------------------------------


// let y = Number(prompt("Будь ласка укажить число "));
// console.log(y)

// if( y > 1){
//   for (let i=2; i<= y; i++){
//     if(y % i === 0){
//       console.log(i)
//       prompt(`${y}, "не є простим числом"`)
//       break
//     } if (i === y - 1) {
//       prompt(`${y}, "є простим числом"`)
//       break
//     }
//   }
// }
// else{
//   prompt(`${y}, "не є простим числом"`)
// }

// 5------------------------------------------------


const number = parseInt(prompt("Введіть число: "));
let temp = 1;
while (temp < number) {
  temp *= 3;
}
if (temp === number) {
  console.log(`${number} можна отримати шляхом зведення числа 3 у деякий ступінь.`)} else {
  console.log(`${number} не можна отримати шляхом зведення числа 3 у деякий ступінь.`);
}